src/Ssl_CI/Catalogs/SslCI_Разработчики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>SslCI_Разработчики</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>АдресаПочты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Мыло</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Ssl_CI/Catalogs/SslCI_Разработчики/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПометкаУдаления Тогда
		
		ИспользуемыеПочтовыеАдреса = АдресаПочты.ВыгрузитьКолонку("Мыло");
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Почта", ИспользуемыеПочтовыеАдреса);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	SslCI_РазработчикиАдресаПочты.Мыло КАК Мыло,
		|	SslCI_РазработчикиАдресаПочты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.SslCI_Разработчики.АдресаПочты КАК SslCI_РазработчикиАдресаПочты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.SslCI_Разработчики КАК SslCI_Разработчики
		|		ПО SslCI_РазработчикиАдресаПочты.Ссылка = SslCI_Разработчики.Ссылка
		|ГДЕ
		|	SslCI_РазработчикиАдресаПочты.Ссылка <> &Ссылка
		|	И SslCI_РазработчикиАдресаПочты.Мыло В(&Почта)
		|	И НЕ SslCI_Разработчики.ПометкаУдаления";
		
		Выборка = Запрос.Выполнить().Выбрать(); 
		
		ШаблонСообщения = НСтр("ru = 'Почтовый адрес ""%1"" уже используется для разработчика ""%2""'");
		
		Пока Выборка.Следующий() Цикл
			ТекстСообщения 	= СтрШаблон(ШаблонСообщения, Выборка.Мыло, Выборка.Ссылка);
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Выборка.Ссылка, , , Отказ);			
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
